const Story = () => {
    return (
        <div className="container mx-auto flex flex-col md:flex-row gap-8 my-10">
            <div className="w-full md:w-1/2  p-8 space-y-4">
                <h3 className="font-bold text-[#C09059] text-3xl mb-4 border-b-2 border-[#C09059] inline-block pb-2">
                    رحلتنا من الألعاب المعيارية إلى المساكن المرنة بدأت من فكرة إلى منظومة متكاملة
                </h3>

                <div className="space-y-4 text-[#474747] leading-relaxed text-lg">
                    {/* <h2 className="">رحلتنا من الألعاب المعيارية إلى المساكن المرنة بدأت من فكرة إلى منظومة متكاملة</h2> */}
                    <p>

                    بدأت رحلتنا في عام 2016، برؤية واضحة لإحداث ثورة في التصميم المعياري (Modular Design)، بهدف إنشاء حلول عملية ومؤثرة تخدم الناس والمجتمعات بطريقة مبتكرة ومستدامة
                    حيث وُلدت الفكرة من إيمان عميق بأن التصميم يمكن أن يكون أداة للتغيير، وأن الحلول الحقيقية تبدأ من فهم الإنسان واحتياجاته وتحويلها الى منتج مبتكر يساعد الانسان على سد احتياجاته.

                    </p>
                    <p>
                        في عام 2018، تحولت الرؤية إلى واقع ملموس، عندما بدأنا في تطوير ألعاب تعليمية تعتمد على التصميم المعياري(Modular Design)، تهدف إلى تنمية الإبداع، حل المشكلات، والتعلم العملي لدى الأطفال. وهنا لم تكن مجرد
                        ألعاب، بل أدوات تعليمية ذكية تربط اللعب بالتجربة التعليمية وتعكس فلسفة التصميم المرن القابل للتطوير.     

                    </p>
                    <p>
                    تعتمد هذه  الألعاب  على التصميم المعياري و تهدف إلى تنمية التفكير، وتحفيز الإبداع، وربط التعلم بالتجربة العملية..


                    بحلول عام 2019، أكسبتنا خبرتنا في تصميم أنظمة معيارية دقيقة وسهلة التركيب أول طلباتنا المسبقة وكانت أولى ثمار هذا العمل ، وهذا يؤكد بأن نهجنا ليس فكرة فقط، بل نموذج قابل للتطبيق والتوسع.
                    حيث بدأنا بتلقي طلبات فعلية على منتجاتنا التعليمية، نتيجة الثقة التي بُنيت في جودة التصميم، ودقة التنفيذ، وسهولة التركيب والتخصيص.
                    </p>
                    <p>
                        مع تقدم السنوات و تسارع التغيرات العالمية و خاصة 2024–2025 انتقلنا من نطاق الألعاب التعليمية إلى آفاق أوسع، توسعت رؤيتنا لتشمل المساكن المرنة المستدامة، المعتمدة على إعادة التدوير، لتقديم حلول قابلة للتكيف مع المجتمعات الحديثة وحالات الطوارئ. انطلاقاً من اعتقاد بسيط:
                        ( يستحق الجميع منازل جميلة ومستدامة دون أوقات بناء طويلة وتكاليف باهظة للبناء التقليدي).

                        وبدأنا مرحلة جديدة من الابتكار في المساكن المرنة والمستدامة، القائمة على إعادة التدوير، وتقليل الهدر، والاستجابة السريعة للاحتياجات الإنسانية.

                        رأى المؤسس باسل الهرباوي،  فرصةً لإحداث ثورة في بناء المنازل من خلال الجمع بين تقنيات التصنيع المتطورة ومبادئ التصاميم المستدامة المرنة والتي تحافظ على الموارد، فوضع معيارًا جديدًا للحياة المستدامة، حيث تعتمد تصاميمنا على  الطاقة المتجددة والمواد الصديقة للبيئة واعادة التدوير، مما يضمن مساهمة كل منتج من منتجاتنا في كوكب أكثر صحة.

                    </p>

                    <p>
                        وفي عام 2025، أقمنا شراكات استراتيجية مع شركات عالمية، حيث انطلقنا بشراكات استراتيجية مع شركات
                         صناعية في الصين، تهدف هذه  الشراكات إلى استيراد وتصنيع بيوت متنقلة  ومعيارية متوافقة مع فلسفة التصميم المعياري التي نؤمن بها والتي منها من ابتكاراتنا، لتكون قابلة للتكيّف، وسهلة النقل، ومناسبة للبيئات المختلفة للاستخدام الإنساني و المجتمعي والتنموي. ومصممة خصيصًا لتكون قابلة للنقل وتكون
                          أكثر مرونة واستدامة، مع الحفاظ على فلسفة التصميم المعياري التي أثبتت نجاحها في منتجاتنا التعليمية.
                    </p>

                    <p>
                        وهكذا، تحولت رحلتنا من لعبة تعليمية بسيطة إلى منظومة عالمية مبتكرة، تعيد تعريف كيفية التعلم، العيش، والبناء المستدام.

                        وهنا  لم تكن رحلتنا مجرد انتقال من منتج إلى آخر، بل رحلة فكرية وتقنية بدأت بلعبة تعليمية، وتحوّلت إلى منظومة متكاملة تعيد تعريف مفهوم البناء، التعليم، والاستدامة.

                        هذه ليست نهاية القصة…بل بداية مرحلة جديدة، نعيد فيها تشكيل المستقبل و نواصل فيها الابتكار خطوة بخطوة.

                    </p>

                        <h3 className="font-bold">
🧩 من الفكرة إلى الثورة: قصة رحلة البناء المتحول عالميًا                             
                        </h3>
                    <p>
                        في عالم
                         يشهد تحوّلات جذرية في كل مجال، لم يبقَ قطاع البناء خارج نطاق الثورة. لقد بدأت الحاجة إلى طرق بناء أكثر سرعة، كفاءة، ومرونة مع الارتفاع السريع في الطلب على المساكن، الضغوط البيئية، وحالات الطوارئ التي تتطلب حلولًا فورية.
                          ومن هنا انطلقت رحلة تصميم المباني المعيارية (Modular Design) - ليس فقط كبديل للبناء التقليدي، بل كنقطة
                           انطلاق نحو نظام بناء جديد كليًا.
                    </p>

                    
                        <h3 className="font-bold">   
                            🏗 البدايات: (Modular Design) ليس مجرد فكرة  
                        </h3>
                    <p> 
                        القصة الحديثة لتصميم المباني المعيارية
                         بدأت من عمق الدمار في غزة ،حيث يتم تصنيع الوحدات خارج موقع البناء، ثم يتم تركيبها وتجميعها مثل قطع LEGO للوصول إلى مبنى كامل. هذه الطريقة تسمح بتسريع عملية البناء
                          وتقلّل من الهدر وتؤدي إلى منتجات أكثر دقة وجودة مقارنةً بالبناء التقليدي. 
                        القيمة الأساسية لهذه الفكرة أنَّ البناء يصبح قابلًا للقياس والتحكم والتكرار، حيث أن  كل وحدة تمثل قطعة في نظام أكبر، ويمكن
                         إنتاجها بكميات كبيرة في مصانع مجهزة وتوصيلها إلى الموقع للتجميع النهائي. 
                        </p>

                        <h3 className="font-bold">
                            🏠 الانتقال العالمي: لماذا أصبح Modular Design ضرورة؟
                        </h3>
                        <p>
                            في عالمنا اليوم، هناك تحديات لا تُحصى:
                            أزمات الإسكان الحادة في كثير من المدن الكبرى، حيث لا يواكب العرض الطلب.
                            الكوارث الطبيعية والحروب التي تُدمِّر البنية التحتية وتُحدث أزمات سكنية طارئة.
                            الاهتمام المتزايد بالاستدامة وتقليل الانبعاثات الكربونية.
                            بناءً على ذلك، أصبح الـ Modular Design ليس خيارًا عابر ليس له قيمة كبيرة أو ثانوي أو يعتبر من الكماليات وإنما اتجاهًا عالميًا متسارعًا لتلبية هذه الاحتياجات. حيث أن استخدام هذا النوع من البناء يسمح بتقليل مدة التنفيذ، تقليل الهدر، وزيادة المرونة في التصميم. 

                        </p>

                        <h3 className="font-bold">
                            🔄 المرونة في البناء Resilient Construction
                        </h3>
                        <p>
                            مع التغيرات المناخية والأزمات الكبرى (زلازل، فيضانات، كوارث بيئية)، ظهر ما يُعرف بـ المباني المرنة Resilient Buildings — أي مبانٍ قادرة على التكيّف والتحمل والتعافي بسرعة بعد الأزمات.
                            هنا يظهر دور الشركات والمفاهيم الحديثة مثل ReframeBuilds (مستمدة من روح Reframe Systems) التي تقدم منازل ذكية ومستدامة جاهزة للسكن بتصاميم تجمع بين الراحة، الاستدامة، والتسليم السريع. 
                            التصميم المرن لا يعني فقط سرعة البناء، بل يعني أيضًا بناء وحدات يمكن تحديثها، نقلها، أو إعادة تكوينها حسب الحاجة -ما يجعلها مثالية للحياة المتغيرة، الأزمات، وحتى المشاريع المستقبلية.
                        </p>

                        <h3 className="font-bold">
                            🏭 التحول إلى التصنيع المحلي وإعادة التدوير
                        </h3>
                        <p>
                            مع ازدياد حجم الدمار العالمي والحاجة إلى حلول سريعة، بدأ التفكير في نقل البناء من المواقع التقليدية إلى خطوط إنتاج متقدمة — مصانع صغيرة موزعة (Microfactories) قريبة من المشاريع، تتحكم بدقة في كل مرحلة من التصميم حتى التسليم. 
                            لكن هنا، تأتي خطوة أكبر: الابتكار في إعادة التدوير. بدلاً من الاعتماد فقط على مواد صناعية جديدة، لذلك بدأ الباحثون والمصممون في:
                            استخدام المواد المعاد تدويرها كمواد خام جديدة.
                            إدماج مواد مستدامة في التصنيع مثل الأخشاب المعاد تدويرها، البلاستيك المُعاد تدويره، وغيرها.
                            تصميم وحدات يمكن تفكيكها وإعادة استخدامها في مشاريع جديدة .
                            هذه الفكرة  تحول البناء من عملية هدر الموارد  إلى نظام دائري مستدام.
                        </p>

                        <h3 className="font-bold">
                            🏡 من المنازل الجاهزة إلى المستقبل
                        </h3>

                        <p>
                            في نهاية المطاف، تحوّلت هذه الرؤية إلى نظام بناء متكامل:
                        </p>
                        <ul className="list-disc">
                            <li>تصميم معياري مرن — قابل للتخصيص والتكرار.</li>
                            <li>تصنيع سريع ودقيق في مصانع ذكية.</li>
                            <li>حلول مرنة تتحمل التغيرات والأزمات.</li>
                            <li>دمج الاستدامة وإعادة التدوير في العمود الفقري للبناء.</li>
                            <li>منازل جاهزة للسكن بأسبوع أو أقل  بدل شهور أو سنوات. </li>
                        </ul>

                        <h3 className="font-bold">في النهاية</h3>
                        <p>
                             في النهاية
                            اليوم، لا يُنظر إلى البناء كمجموعة من الحرف اليدوية التقليدية، بل كـ نظام صناعي ذكي ومبتكر يستجيب لاحتياجات البشر سريعًا. القصة لم تعد  بيت يُشيَّد فقط، بل عن التنقل من أزمة إلى أمل، من تدمير إلى إعادة
                            بناء، ومن مواد تُهدر إلى موارد تُدوَّر وتُعاد للحياة، من الموت الى الحياة.
                        </p>

                        <h3 className="font-bold">وهنا يكمن جوهر الرواية في:</h3>
                        <p>
                            (البناء لم يعد فقط  يختص بعلوم الهندسة والمواد 
                            ، بل أصبح نظامًا بيئيًا متكاملاً للصمود وللابتكار وللمستقبل المستدام والامل).
                        </p>
                </div>
            </div>

            <div className="w-full p-3 md:w-1/2 flex justify-center">
                <img
                    src="/about.jpg"
                    alt="عن EcoHomes"
                    className="w-full h-82 max-w-md rounded-2xl shadow-lg border border-[#E5E5E5] object-cover"
                />
            </div>
        </div>
    );
};
export default Story;
