

export const models = [
  {
    id: 1,
    name: "فيلا فاخرة",
    size: "150m",
    price: "750,560",
    description: "صُمم منزل العائلة العصرية لحياة عصرية مريحة. يتميز بتصميم مفتوح يُتيح أقصى استفادة من الإضاءة الطبيعية",
    image: "/product-1.jpg",
  },
  {
    id: 2,
    name: "كابين مريحة",
    size: "300m",
    price: "180,000",
    description: "صُمم منزل العائلة العصرية لحياة عصرية مريحة. يتميز بتصميم مفتوح يُتيح أقصى استفادة من الإضاءة الطبيعية",
    image: "/product-2.jpg",
  },
  {
    id: 3,
    name: "الأسرة الحديثة",
    size: "250m",
    price: "250,000",
    description: "صُمم منزل العائلة العصرية لحياة عصرية مريحة. يتميز بتصميم مفتوح يُتيح أقصى استفادة من الإضاءة الطبيعية",
    image: "/product-3.jpg",
  },
];
