import { House } from 'lucide-react';
import { Hammer } from 'lucide-react';
import { Lightbulb } from 'lucide-react';
import { Package } from 'lucide-react';
import { Truck } from 'lucide-react';
import { BrushCleaning } from 'lucide-react';


export const ServiceInformation = [
    {
        id:1,
        icon:House,
        name:"تصميم منزل مخصص",
        disc: "اعمل مع فريق يجمع بين الخبرة العالمية والمحلية لتصميم منازل جاهزة مخصصة بالكامل ومصممة خصيصاً وفق لرؤيتك الفريدة وأسلوب حياتك ومتطلبات موقعك.",
        list:[
            " استشارات معمارية",
            " تطوير مخططات لتوقعاتك في السكن لوحدات سكانية ومنفعة مخصصة",
            " اختيار المواد والشكل النهائي الخارجي والداخلي",
            " التصور والعرض ثلاثي الأبعاد"
        ]
    },
    {
        id:2,
        icon:Hammer,
        name:"خدمات البناء الكاملة",
        disc: "حل جاهز متكامل من اعداد الموقع الى التثبيت(التركيب) النهائي مما يضمن منزلك الجاهز للسكن مع حرفية واحترافية.",
        list:[
            " تقييم الموقع وتجهيزه ",
            " تركيب الأساسات والمرافق",
            " التوصيل والتركيب ",
            " الفحوصات النهائية وشهادات الجودة"
        ]
    },
    {
        id:3,
        icon:Lightbulb,
        name:"استشارة التصميم الداخلي",
        disc: "قم بتحويل منزلك  الى ما يدور في مخيلتك من  تصور لمنزل العمر مع خدمات التصميم الداخلي الاحترافية وخيارات التشطيب المخصصة .",
        list:[
            " تخطيط المساحات وتحسين التصميم.",
            " اختيار الالوان المناسبة والمواد.",
            " توصيات الاثاث والديكور.",
            " تخطيط دمج التقنيات الحديثة لتحويل منزلك الى منزل ذكي."
        ]
    },
    {
        id:4,
        icon:Package,
        name:"الإضافات المعيارية",
        disc: " قم بتغير شكل  أو حجم منزلك الحالي بإضافات معيارية تتكامل بسلاسة مع هيكله الحالي مع الحفاظ على الانسجام المعماري",
        list:[
            " اضافات جديدة للغرف والمرافق",
            " بيوت الضيافة والوحدات السكانية الاضافية",
            " ابتكار وحدات مكتبية وسكانية ",
            " حلول المرآب والتخزين"
        ]
    },
    {
        id:5,
        icon:Truck,
        name:"التسليم والتركيب",
        disc: " خدمات التوصيل والتركيب الاحترافية تضمن وصول منزلك الجاهز بأمان وتجميعه بخبرة عالمية متنقلة بين الدول ومتوافقة مع الاحتياجات ",
        list:[
            " تنسيق التوصيل على مستوى الدولة",
            " خدمات الرافعات والمعدات الثقيلة المرتبطة مع خدمات الاعمار الدولية",
            " فرق تركيب متخصصة بشراكة عالمية",
            "دعم ما بعد التركيب"
        ]
    },
    {
        id:6,
        icon:BrushCleaning,
        name:"الصيانة والدعم",
        disc: "برامج الصيانة  المستمرة وخدمات الدعم للحفاظ على منزلك في حالة جيدة لسنوات قادمة ",
        list:[
            " فحصوات الصيانة السنوية",
            " تغطية الضمان والاصلاحات",
            " خدمات الترقية والتجديد",
            " خط ساخن لخدمة العملاء على مدار الساعة في كل أيام العمل السنوية."
        ]
    }
    
]