import { House } from 'lucide-react';
import { Hammer } from 'lucide-react';
import { Lightbulb } from 'lucide-react';
import { Package } from 'lucide-react';
import { Truck } from 'lucide-react';
import { BrushCleaning } from 'lucide-react';


export const ServiceInformation = [
    {
        id:1,
        icon:House,
        name:"تصميم منزل مخصص",
        disc: "اعمل مع مهندسينا الخبراء لتصميم منزل جاهز مخصص بالكامل ومصمم خصيصًا وفقًا لرؤيتك الفريدة وأسلوب حياتك ومتطلبات موقعك.",
        list:[
            " استشارات معمارية شخصية",
            "  تطوير مخططات طوابق مخصصة",
            " اختيار المواد والتشطيبات",
            " التصور والعرض ثلاثي الأبعاد"
        ]
    },
    {
        id:2,
        icon:Hammer,
        name:"خدمات البناء الكاملة",
        disc: "حل جاهز متكامل من إعداد الموقع إلى التثبيت النهائي، مما يضمن أن منزلك جاهز للسكن مع حرفية احترافية.",
        list:[
            "تقييم الموقع وتجهيزه",
            "تركيب الأساسات والمرافق",
            "التوصيل والتركيب المنزل",
            "الفحوصات النهائية والشهادات"
        ]
    },
    {
        id:3,
        icon:Lightbulb,
        name:"استشارة التصميم الداخلي",
        disc: "قم بتحويل منزلك الجاهز إلى ملاذ شخصي مع خدمات التصميم الداخلي الاحترافية لدينا وخيارات التشطيب المخصصة.",
        list:[
            "تخطيط المساحات وتحسين التصميم",
            "اختيار الألوان والمواد",
            "توصيات الأثاث والديكور",
            "تخطيط دمج المنزل الذكي"
        ]
    },
    {
        id:4,
        icon:Package,
        name:"الإضافات المعيارية",
        disc: "قم بتوسيع منزلك الحالي بإضافات معيارية تتكامل بسلاسة مع هيكلك الحالي مع الحفاظ على الانسجام المعماري.",
        list:[
            "إضافات وتوسعات للغرف",
            "بيوت الضيافة والوحدات السكنية الإضافية",
            "وحدات المكاتب المنزلية",
            "حلول المرآب والتخزين"
        ]
    },
    {
        id:5,
        icon:Truck,
        name:"التسليم والتركيب",
        disc: "خدمات التوصيل والتركيب الاحترافية تضمن وصول منزلك الجاهز بأمان وتجميعه بخبرة على ممتلكاتك.",
        list:[
            "تنسيق التوصيل على مستوى الدولة",
            "خدمات الرافعات والمعدات الثقيلة",
            "فرق تركيب متخصصة",
            " دعم ما بعد التركيب"
        ]
    },
    {
        id:6,
        icon:BrushCleaning,
        name:"الصيانة والدعم",
        disc: "برامج الصيانة المستمرة وخدمات الدعم للحفاظ على منزلك في حالة جيدة لسنوات قادمة.",
        list:[
            "فحوصات الصيانة السنوية",
            "تغطية الضمان والإصلاحات",
            "خدمات الترقية والتجديد",
            "خط ساخن لخدمة العملاء على مدار الساعة طوال أيام الأسبوع"
        ]
    }
    
]